# Practice problem - Chapter 01

In [1]:
import pandas as pd
import numpy as np
import pymysql
import matplotlib.pyplot as plt
import warnings

warnings.filterwarnings(action='ignore')
file_path = '../data/drinks.csv'
drinks = pd.read_csv(file_path)
drinks['continent'] = drinks['continent'].fillna('OT')
conn = pymysql.connect(host='localhost', port=3306, user='data_analysis_book', passwd='D@taanalysis1', db='this_is_data_analysis', charset='utf8')

## 1. Average wine servings per continent

In [3]:
# python
average_wine = drinks[['wine_servings', 'continent']].groupby(['continent']).mean()
average_wine

           wine_servings
continent
AF             16.264151
AS              9.068182
EU            142.222222
OC             35.625000
OT             24.521739
SA             62.416667

In [6]:
# mysql
query_for_average_wine = """
select
    coalesce(continent, 'OT') as continent,
       avg(wine_servings) as average
from drinks
group by 1
"""
average_wine_by_query = pd.read_sql(query_for_average_wine, conn,index_col='continent')
average_wine_by_query

            average
continent
AS           9.0682
EU         142.2222
AF          16.2642
OT          24.5217
SA          62.4167
OC          35.6250

## 2. Make feature total_servings which calculate sum all of servings each status.

In [4]:
# python

In [5]:
# mysql

## 3. Find the continent that drinks less alcohol than the overall average, the country that drinks the most spirits.

In [6]:
# python

In [7]:
# mysql

## 4. Find the ratio of alcohol to alcohol consumption.

In [8]:
# python

In [9]:
# mysql

## 5. Calculate the ratio of alcohol to alcohol consumption by continent.

In [10]:
# python

In [11]:
# mysql

In [7]:
conn.close()